Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_jh01_curiosity_pro/pic32cm_jh01_cpro_getting_started/firmware/src/packs/PIC32CM5164JH01100_DFP/component/eic.h
#define EIC_DEBOUNCEN_DEBOUNCEN0_Pos          _UINT32_(0)                                          /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT0 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN0_Msk          (_UINT32_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN0_Pos)      /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT0 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN0(value)       (EIC_DEBOUNCEN_DEBOUNCEN0_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN0_Pos)) /* Assigment of value for DEBOUNCEN0 in the EIC_DEBOUNCEN register */
#define EIC_DEBOUNCEN_DEBOUNCEN1_Pos          _UINT32_(1)                                          /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT1 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN1_Msk          (_UINT32_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN1_Pos)      /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT1 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN1(value)       (EIC_DEBOUNCEN_DEBOUNCEN1_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN1_Pos)) /* Assigment of value for DEBOUNCEN1 in the EIC_DEBOUNCEN register */
#define EIC_DEBOUNCEN_DEBOUNCEN2_Pos          _UINT32_(2)                                          /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT2 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN2_Msk          (_UINT32_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN2_Pos)      /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT2 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN2(value)       (EIC_DEBOUNCEN_DEBOUNCEN2_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN2_Pos)) /* Assigment of value for DEBOUNCEN2 in the EIC_DEBOUNCEN register */
#define EIC_DEBOUNCEN_DEBOUNCEN3_Pos          _UINT32_(3)                                          /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT3 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN3_Msk          (_UINT32_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN3_Pos)      /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT3 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN3(value)       (EIC_DEBOUNCEN_DEBOUNCEN3_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN3_Pos)) /* Assigment of value for DEBOUNCEN3 in the EIC_DEBOUNCEN register */
#define EIC_DEBOUNCEN_DEBOUNCEN4_Pos          _UINT32_(4)                                          /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT4 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN4_Msk          (_UINT32_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN4_Pos)      /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT4 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN4(value)       (EIC_DEBOUNCEN_DEBOUNCEN4_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN4_Pos)) /* Assigment of value for DEBOUNCEN4 in the EIC_DEBOUNCEN register */
#define EIC_DEBOUNCEN_DEBOUNCEN5_Pos          _UINT32_(5)                                          /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT5 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN5_Msk          (_UINT32_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN5_Pos)      /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT5 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN5(value)       (EIC_DEBOUNCEN_DEBOUNCEN5_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN5_Pos)) /* Assigment of value for DEBOUNCEN5 in the EIC_DEBOUNCEN register */
#define EIC_DEBOUNCEN_DEBOUNCEN6_Pos          _UINT32_(6)                                          /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT6 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN6_Msk          (_UINT32_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN6_Pos)      /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT6 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN6(value)       (EIC_DEBOUNCEN_DEBOUNCEN6_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN6_Pos)) /* Assigment of value for DEBOUNCEN6 in the EIC_DEBOUNCEN register */
#define EIC_DEBOUNCEN_DEBOUNCEN7_Pos          _UINT32_(7)                                          /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT7 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN7_Msk          (_UINT32_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN7_Pos)      /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT7 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN7(value)       (EIC_DEBOUNCEN_DEBOUNCEN7_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN7_Pos)) /* Assigment of value for DEBOUNCEN7 in the EIC_DEBOUNCEN register */
#define EIC_DEBOUNCEN_DEBOUNCEN8_Pos          _UINT32_(8)                                          /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT8 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN8_Msk          (_UINT32_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN8_Pos)      /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT8 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN8(value)       (EIC_DEBOUNCEN_DEBOUNCEN8_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN8_Pos)) /* Assigment of value for DEBOUNCEN8 in the EIC_DEBOUNCEN register */
#define EIC_DEBOUNCEN_DEBOUNCEN9_Pos          _UINT32_(9)                                          /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT9 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN9_Msk          (_UINT32_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN9_Pos)      /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT9 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN9(value)       (EIC_DEBOUNCEN_DEBOUNCEN9_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN9_Pos)) /* Assigment of value for DEBOUNCEN9 in the EIC_DEBOUNCEN register */
#define EIC_DEBOUNCEN_DEBOUNCEN10_Pos         _UINT32_(10)                                         /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT10 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN10_Msk         (_UINT32_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN10_Pos)     /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT10 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN10(value)      (EIC_DEBOUNCEN_DEBOUNCEN10_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN10_Pos)) /* Assigment of value for DEBOUNCEN10 in the EIC_DEBOUNCEN register */
#define EIC_DEBOUNCEN_DEBOUNCEN11_Pos         _UINT32_(11)                                         /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT11 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN11_Msk         (_UINT32_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN11_Pos)     /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT11 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN11(value)      (EIC_DEBOUNCEN_DEBOUNCEN11_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN11_Pos)) /* Assigment of value for DEBOUNCEN11 in the EIC_DEBOUNCEN register */
#define EIC_DEBOUNCEN_DEBOUNCEN12_Pos         _UINT32_(12)                                         /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT12 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN12_Msk         (_UINT32_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN12_Pos)     /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT12 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN12(value)      (EIC_DEBOUNCEN_DEBOUNCEN12_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN12_Pos)) /* Assigment of value for DEBOUNCEN12 in the EIC_DEBOUNCEN register */
#define EIC_DEBOUNCEN_DEBOUNCEN13_Pos         _UINT32_(13)                                         /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT13 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN13_Msk         (_UINT32_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN13_Pos)     /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT13 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN13(value)      (EIC_DEBOUNCEN_DEBOUNCEN13_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN13_Pos)) /* Assigment of value for DEBOUNCEN13 in the EIC_DEBOUNCEN register */
#define EIC_DEBOUNCEN_DEBOUNCEN14_Pos         _UINT32_(14)                                         /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT14 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN14_Msk         (_UINT32_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN14_Pos)     /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT14 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN14(value)      (EIC_DEBOUNCEN_DEBOUNCEN14_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN14_Pos)) /* Assigment of value for DEBOUNCEN14 in the EIC_DEBOUNCEN register */
#define EIC_DEBOUNCEN_DEBOUNCEN15_Pos         _UINT32_(15)                                         /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT15 Position */
#define EIC_DEBOUNCEN_DEBOUNCEN15_Msk         (_UINT32_(0x1) << EIC_DEBOUNCEN_DEBOUNCEN15_Pos)     /* (EIC_DEBOUNCEN) Debouncer Enable of EXTINT15 Mask */
#define EIC_DEBOUNCEN_DEBOUNCEN15(value)      (EIC_DEBOUNCEN_DEBOUNCEN15_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN15_Pos)) /* Assigment of value for DEBOUNCEN15 in the EIC_DEBOUNCEN register */
#define EIC_DEBOUNCEN_Msk                     _UINT32_(0x0000FFFF)                                 /* (EIC_DEBOUNCEN) Register Mask  */

#define EIC_DEBOUNCEN_DEBOUNCEN_Pos           _UINT32_(0)                                          /* (EIC_DEBOUNCEN Position) Debouncer Enable of EXTINTx5 */
#define EIC_DEBOUNCEN_DEBOUNCEN_Msk           (_UINT32_(0xFFFF) << EIC_DEBOUNCEN_DEBOUNCEN_Pos)    /* (EIC_DEBOUNCEN Mask) DEBOUNCEN */
#define EIC_DEBOUNCEN_DEBOUNCEN(value)        (EIC_DEBOUNCEN_DEBOUNCEN_Msk & (_UINT32_(value) << EIC_DEBOUNCEN_DEBOUNCEN_Pos)) 

/* -------- EIC_DPRESCALER : (EIC Offset: 0x34) (R/W 32) Debouncer Prescaler -------- */
#define EIC_DPRESCALER_RESETVALUE             _UINT32_(0x00)                                       /*  (EIC_DPRESCALER) Debouncer Prescaler  Reset Value */

#define EIC_DPRESCALER_PRESCALER0_Pos         _UINT32_(0)                                          /* (EIC_DPRESCALER) Debouncer Prescaler Position */
#define EIC_DPRESCALER_PRESCALER0_Msk         (_UINT32_(0x7) << EIC_DPRESCALER_PRESCALER0_Pos)     /* (EIC_DPRESCALER) Debouncer Prescaler Mask */
#define EIC_DPRESCALER_PRESCALER0(value)      (EIC_DPRESCALER_PRESCALER0_Msk & (_UINT32_(value) << EIC_DPRESCALER_PRESCALER0_Pos)) /* Assigment of value for PRESCALER0 in the EIC_DPRESCALER register */
#define   EIC_DPRESCALER_PRESCALER0_DIV2_Val  _UINT32_(0x0)                                        /* (EIC_DPRESCALER) EIC clock divided by 2  */
#define   EIC_DPRESCALER_PRESCALER0_DIV4_Val  _UINT32_(0x1)                                        /* (EIC_DPRESCALER) EIC clock divided by 4  */
#define   EIC_DPRESCALER_PRESCALER0_DIV8_Val  _UINT32_(0x2)                                        /* (EIC_DPRESCALER) EIC clock divided by 8  */
#define   EIC_DPRESCALER_PRESCALER0_DIV16_Val _UINT32_(0x3)                                        /* (EIC_DPRESCALER) EIC clock divided by 16  */
#define   EIC_DPRESCALER_PRESCALER0_DIV32_Val _UINT32_(0x4)                                        /* (EIC_DPRESCALER) EIC clock divided by 32  */
#define   EIC_DPRESCALER_PRESCALER0_DIV64_Val _UINT32_(0x5)                                        /* (EIC_DPRESCALER) EIC clock divided by 64  */
#define   EIC_DPRESCALER_PRESCALER0_DIV128_Val _UINT32_(0x6)                                        /* (EIC_DPRESCALER) EIC clock divided by 128  */
#define   EIC_DPRESCALER_PRESCALER0_DIV256_Val _UINT32_(0x7)                                        /* (EIC_DPRESCALER) EIC clock divided by 256  */
#define EIC_DPRESCALER_PRESCALER0_DIV2        (EIC_DPRESCALER_PRESCALER0_DIV2_Val << EIC_DPRESCALER_PRESCALER0_Pos) /* (EIC_DPRESCALER) EIC clock divided by 2 Position  */
#define EIC_DPRESCALER_PRESCALER0_DIV4        (EIC_DPRESCALER_PRESCALER0_DIV4_Val << EIC_DPRESCALER_PRESCALER0_Pos) /* (EIC_DPRESCALER) EIC clock divided by 4 Position  */
#define EIC_DPRESCALER_PRESCALER0_DIV8        (EIC_DPRESCALER_PRESCALER0_DIV8_Val << EIC_DPRESCALER_PRESCALER0_Pos) /* (EIC_DPRESCALER) EIC clock divided by 8 Position  */
#define EIC_DPRESCALER_PRESCALER0_DIV16       (EIC_DPRESCALER_PRESCALER0_DIV16_Val << EIC_DPRESCALER_PRESCALER0_Pos) /* (EIC_DPRESCALER) EIC clock divided by 16 Position  */
#define EIC_DPRESCALER_PRESCALER0_DIV32       (EIC_DPRESCALER_PRESCALER0_DIV32_Val << EIC_DPRESCALER_PRESCALER0_Pos) /* (EIC_DPRESCALER) EIC clock divided by 32 Position  */
#define EIC_DPRESCALER_PRESCALER0_DIV64       (EIC_DPRESCALER_PRESCALER0_DIV64_Val << EIC_DPRESCALER_PRESCALER0_Pos) /* (EIC_DPRESCALER) EIC clock divided by 64 Position  */
#define EIC_DPRESCALER_PRESCALER0_DIV128      (EIC_DPRESCALER_PRESCALER0_DIV128_Val << EIC_DPRESCALER_PRESCALER0_Pos) /* (EIC_DPRESCALER) EIC clock divided by 128 Position  */
#define EIC_DPRESCALER_PRESCALER0_DIV256      (EIC_DPRESCALER_PRESCALER0_DIV256_Val << EIC_DPRESCALER_PRESCALER0_Pos) /* (EIC_DPRESCALER) EIC clock divided by 256 Position  */
#define EIC_DPRESCALER_STATES0_Pos            _UINT32_(3)                                          /* (EIC_DPRESCALER) Debouncer number of states Position */
#define EIC_DPRESCALER_STATES0_Msk            (_UINT32_(0x1) << EIC_DPRESCALER_STATES0_Pos)        /* (EIC_DPRESCALER) Debouncer number of states Mask */
#define EIC_DPRESCALER_STATES0(value)         (EIC_DPRESCALER_STATES0_Msk & (_UINT32_(value) << EIC_DPRESCALER_STATES0_Pos)) /* Assigment of value for STATES0 in the EIC_DPRESCALER register */
#define   EIC_DPRESCALER_STATES0_LFREQ3_Val   _UINT32_(0x0)                                        /* (EIC_DPRESCALER) 3 low frequency samples  */
#define   EIC_DPRESCALER_STATES0_LFREQ7_Val   _UINT32_(0x1)                                        /* (EIC_DPRESCALER) 7 low frequency samples  */
#define EIC_DPRESCALER_STATES0_LFREQ3         (EIC_DPRESCALER_STATES0_LFREQ3_Val << EIC_DPRESCALER_STATES0_Pos) /* (EIC_DPRESCALER) 3 low frequency samples Position  */
#define EIC_DPRESCALER_STATES0_LFREQ7         (EIC_DPRESCALER_STATES0_LFREQ7_Val << EIC_DPRESCALER_STATES0_Pos) /* (EIC_DPRESCALER) 7 low frequency samples Position  */
#define EIC_DPRESCALER_PRESCALER1_Pos         _UINT32_(4)                                          /* (EIC_DPRESCALER) Debouncer Prescaler Position */
#define EIC_DPRESCALER_PRESCALER1_Msk         (_UINT32_(0x7) << EIC_DPRESCALER_PRESCALER1_Pos)     /* (EIC_DPRESCALER) Debouncer Prescaler Mask */
#define EIC_DPRESCALER_PRESCALER1(value)      (EIC_DPRESCALER_PRESCALER1_Msk & (_UINT32_(value) << EIC_DPRESCALER_PRESCALER1_Pos)) /* Assigment of value for PRESCALER1 in the EIC_DPRESCALER register */
#define   EIC_DPRESCALER_PRESCALER1_DIV2_Val  _UINT32_(0x0)                                        /* (EIC_DPRESCALER) EIC clock divided by 2  */
#define   EIC_DPRESCALER_PRESCALER1_DIV4_Val  _UINT32_(0x1)                                        /* (EIC_DPRESCALER) EIC clock divided by 4  */
#define   EIC_DPRESCALER_PRESCALER1_DIV8_Val  _UINT32_(0x2)                                        /* (EIC_DPRESCALER) EIC clock divided by 8  */
#define   EIC_DPRESCALER_PRESCALER1_DIV16_Val _UINT32_(0x3)                                        /* (EIC_DPRESCALER) EIC clock divided by 16  */
#define   EIC_DPRESCALER_PRESCALER1_DIV32_Val _UINT32_(0x4)                                        /* (EIC_DPRESCALER) EIC clock divided by 32  */
#define   EIC_DPRESCALER_PRESCALER1_DIV64_Val _UINT32_(0x5)                                        /* (EIC_DPRESCALER) EIC clock divided by 64  */
#define   EIC_DPRESCALER_PRESCALER1_DIV128_Val _UINT32_(0x6)                                        /* (EIC_DPRESCALER) EIC clock divided by 128  */
#define   EIC_DPRESCALER_PRESCALER1_DIV256_Val _UINT32_(0x7)                                        /* (EIC_DPRESCALER) EIC clock divided by 256  */
#define EIC_DPRESCALER_PRESCALER1_DIV2        (EIC_DPRESCALER_PRESCALER1_DIV2_Val << EIC_DPRESCALER_PRESCALER1_Pos) /* (EIC_DPRESCALER) EIC clock divided by 2 Position  */
#define EIC_DPRESCALER_PRESCALER1_DIV4        (EIC_DPRESCALER_PRESCALER1_DIV4_Val << EIC_DPRESCALER_PRESCALER1_Pos) /* (EIC_DPRESCALER) EIC clock divided by 4 Position  */
#define EIC_DPRESCALER_PRESCALER1_DIV8        (EIC_DPRESCALER_PRESCALER1_DIV8_Val << EIC_DPRESCALER_PRESCALER1_Pos) /* (EIC_DPRESCALER) EIC clock divided by 8 Position  */
#define EIC_DPRESCALER_PRESCALER1_DIV16       (EIC_DPRESCALER_PRESCALER1_DIV16_Val << EIC_DPRESCALER_PRESCALER1_Pos) /* (EIC_DPRESCALER) EIC clock divided by 16 Position  */
#define EIC_DPRESCALER_PRESCALER1_DIV32       (EIC_DPRESCALER_PRESCALER1_DIV32_Val << EIC_DPRESCALER_PRESCALER1_Pos) /* (EIC_DPRESCALER) EIC clock divided by 32 Position  */
#define EIC_DPRESCALER_PRESCALER1_DIV64       (EIC_DPRESCALER_PRESCALER1_DIV64_Val << EIC_DPRESCALER_PRESCALER1_Pos) /* (EIC_DPRESCALER) EIC clock divided by 64 Position  */
#define EIC_DPRESCALER_PRESCALER1_DIV128      (EIC_DPRESCALER_PRESCALER1_DIV128_Val << EIC_DPRESCALER_PRESCALER1_Pos) /* (EIC_DPRESCALER) EIC clock divided by 128 Position  */
#define EIC_DPRESCALER_PRESCALER1_DIV256      (EIC_DPRESCALER_PRESCALER1_DIV256_Val << EIC_DPRESCALER_PRESCALER1_Pos) /* (EIC_DPRESCALER) EIC clock divided by 256 Position  */
#define EIC_DPRESCALER_STATES1_Pos            _UINT32_(7)                                          /* (EIC_DPRESCALER) Debouncer number of states Position */
#define EIC_DPRESCALER_STATES1_Msk            (_UINT32_(0x1) << EIC_DPRESCALER_STATES1_Pos)        /* (EIC_DPRESCALER) Debouncer number of states Mask */
#define EIC_DPRESCALER_STATES1(value)         (EIC_DPRESCALER_STATES1_Msk & (_UINT32_(value) << EIC_DPRESCALER_STATES1_Pos)) /* Assigment of value for STATES1 in the EIC_DPRESCALER register */
#define   EIC_DPRESCALER_STATES1_LFREQ3_Val   _UINT32_(0x0)                                        /* (EIC_DPRESCALER) 3 low frequency samples  */
#define   EIC_DPRESCALER_STATES1_LFREQ7_Val   _UINT32_(0x1)                                        /* (EIC_DPRESCALER) 7 low frequency samples  */
#define EIC_DPRESCALER_STATES1_LFREQ3         (EIC_DPRESCALER_STATES1_LFREQ3_Val << EIC_DPRESCALER_STATES1_Pos) /* (EIC_DPRESCALER) 3 low frequency samples Position  */
#define EIC_DPRESCALER_STATES1_LFREQ7         (EIC_DPRESCALER_STATES1_LFREQ7_Val << EIC_DPRESCALER_STATES1_Pos) /* (EIC_DPRESCALER) 7 low frequency samples Position  */
#define EIC_DPRESCALER_TICKON_Pos             _UINT32_(16)                                         /* (EIC_DPRESCALER) Pin Sampler frequency selection Position */
#define EIC_DPRESCALER_TICKON_Msk             (_UINT32_(0x1) << EIC_DPRESCALER_TICKON_Pos)         /* (EIC_DPRESCALER) Pin Sampler frequency selection Mask */
#define EIC_DPRESCALER_TICKON(value)          (EIC_DPRESCALER_TICKON_Msk & (_UINT32_(value) << EIC_DPRESCALER_TICKON_Pos)) /* Assigment of value for TICKON in the EIC_DPRESCALER register */
#define   EIC_DPRESCALER_TICKON_CLK_GCLK_EIC_Val _UINT32_(0x0)                                        /* (EIC_DPRESCALER) Clocked by GCLK  */
#define   EIC_DPRESCALER_TICKON_CLK_LFREQ_Val _UINT32_(0x1)                                        /* (EIC_DPRESCALER) Clocked by Low Frequency Clock  */
#define EIC_DPRESCALER_TICKON_CLK_GCLK_EIC    (EIC_DPRESCALER_TICKON_CLK_GCLK_EIC_Val << EIC_DPRESCALER_TICKON_Pos) /* (EIC_DPRESCALER) Clocked by GCLK Position  */
#define EIC_DPRESCALER_TICKON_CLK_LFREQ       (EIC_DPRESCALER_TICKON_CLK_LFREQ_Val << EIC_DPRESCALER_TICKON_Pos) /* (EIC_DPRESCALER) Clocked by Low Frequency Clock Position  */
#define EIC_DPRESCALER_Msk                    _UINT32_(0x000100FF)                                 /* (EIC_DPRESCALER) Register Mask  */


/* -------- EIC_PINSTATE : (EIC Offset: 0x38) ( R/ 32) Pin State -------- */
#define EIC_PINSTATE_RESETVALUE               _UINT32_(0x00)                                       /*  (EIC_PINSTATE) Pin State  Reset Value */

